/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   input.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kamitsui <kamitsui@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/08/10 12:29:35 by kamitsui          #+#    #+#             */
/*   Updated: 2023/08/10 12:29:46 by kamitsui         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/**
 * @brief read_lineを使って終端文字 '\0' まで文字列を返す。
 *
 * @return 型：char *
 */
char	**input(void)
{
	// char	**lines;
	// 例　下記をリードラインする。　\0までの文字列を返す。
	//
	// lines[0]  echo "aaa"\n
	// lines[1]  ls -l\n
	// lines[2]  | cat -e\n
	// lines[3]  '\0'<-ここまで
	// lines[4]  NULL
	//
	// return(lines);
}

